fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполнениеРабот</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентДоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователи</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорияПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВКМ_СтатусЗаявкиНаОбслуживание/ВКМ_СтатусЗаявкиНаОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СтатусЗаявкиНаОбслуживание</name>
  <enumValues>
    <name>ОжидаетсяВыполнениеРабот</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаЗаполнена</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_Клиент</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОплатаЗаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
#Область ОписаниеПеременных
 
    Перем СообщениеТелеграммБоту; // СообщениеТелеграммБоту до записи объекта в базу  
 
#КонецОбласти
 
#Область ОбработчикиСобытий
 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
    // Проверить табличную часть на предмет заполнения выполненных работ.
    // На основании полученных данных установить статус заявки
    Если ВыполнениеРабот.Количество() = 0 Тогда
        СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ОжидаетсяВыполнениеРабот;
    Иначе
        СтатусЗаявки = Перечисления.ВКМ_СтатусЗаявкиНаОбслуживание.ЗаявкаЗаполнена;
    КонецЕсли;    
    
    СообщениеТелеграммБоту = СформироватьСообщениеТелеграммБоту();
    
КонецПроцедуры
 
Процедура ПриЗаписи(Отказ)
    
    Если ОбменДанными.Загрузка Тогда
         
         Возврат;
         
    КонецЕсли;
    
    Если ЗначениеЗаполнено(СообщениеТелеграммБоту) Тогда 
        СообщениеТелеграммБоту = СтрЗаменить(СообщениеТелеграммБоту,"№Заявки",ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер));
        Если Справочники.BKM_УведомленияТелеграмБоту.ДобавитьУведомление(СообщениеТелеграммБоту ) = Неопределено Тогда
            
            ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Формирование уведомления в справочнике. Запись не создана.", УровеньЖурналаРегистрации.Ошибка);
            
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, Режим)
    
    ПроверитьЗаполнениеОбъекта(Отказ); 
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачала КАК ДоговорВКМ_ДатаНачала,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончания КАК ДоговорВКМ_ДатаОкончания,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_АбонентскаяПлата КАК ДоговорВКМ_АбонентскаяПлата,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ОплатаЗаЧас КАК ДоговорВКМ_ОплатаЗаЧас,
			|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
			|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
			|	ВКМ_УсловияОплатыСотрудников.Пользователи КАК Пользователи,
			|	ВКМ_УсловияОплатыСотрудников.ПроцентДоплаты КАК ПроцентДоплаты,
			|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
			|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
			|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудников.Пользователи
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиентаВыполнениеРабот.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
			|	ВКМ_ОбслуживаниеКлиентаВыполнениеРабот.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
			|	вт.ДоговорВидДоговора КАК ДоговорВидДоговора,
			|	вт.ДоговорВКМ_ДатаНачала КАК ДоговорВКМ_ДатаНачала,
			|	вт.ДоговорВКМ_ДатаОкончания КАК ДоговорВКМ_ДатаОкончания,
			|	вт.ДоговорВКМ_АбонентскаяПлата КАК ДоговорВКМ_АбонентскаяПлата,
			|	вт.ДоговорВКМ_ОплатаЗаЧас КАК ДоговорВКМ_ОплатаЗаЧас,
			|	вт.Клиент КАК Клиент,
			|	вт.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
			|	вт.Специалист КАК Специалист,
			|	вт.ПроцентДоплаты КАК ПроцентДоплаты,
			|	вт.Договор КАК Договор
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполнениеРабот КАК ВКМ_ОбслуживаниеКлиентаВыполнениеРабот,
			|	вт КАК вт
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиентаВыполнениеРабот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентДоплаты) Тогда
			Сообщить("Не заполнен процент доплаты у специалиста, проведение отменено");
			Возврат;
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ДоговорВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Клиент") Тогда
			Сообщить("Договор не того типа");
			Возврат;
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ДоговорВКМ_ДатаНачала >= ВыборкаДетальныеЗаписи.ДатаПроведенияРабот ИЛИ ВыборкаДетальныеЗаписи.ДатаПроведенияРабот  >= ВыборкаДетальныеЗаписи.ДоговорВКМ_ДатаОкончания Тогда
			Сообщить("Договор не той даты");
			Возврат;
		КонецЕсли;
		
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
		Движение.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ДоговорВКМ_ОплатаЗаЧас;
	
		Движение1 = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение1.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение1.Период = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
		Движение1.Сотрудник = ВыборкаДетальныеЗаписи.Специалист;
		Движение1.ЧасовКОплате = ВыборкаДетальныеЗаписи.ФактическиПотраченоЧасов;
		Движение1.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ДоговорВКМ_ОплатаЗаЧас *
		ВыборкаДетальныеЗаписи.ПроцентДоплаты / 100;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеОбъекта(Отказ) 
    
 
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |    ДоговорыКонтрагентов.ВидДоговора,
    |    ДоговорыКонтрагентов.BKM_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
    |    ДоговорыКонтрагентов.BKM_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора
    |ИЗ
    |    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |    ДоговорыКонтрагентов.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", Договор );
    Выборка = запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() тогда
        // Проверка вида договора
    
        Если Выборка.ВидДоговора  <>  Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Клиент   Тогда 
            Сообщение = Новый СообщениеПользователю();
            Сообщение.Текст = "Документ не проведен. Для данного вида докуемнтов используется только вид договора ""абонентское обслуживание"".";
            Сообщение.Сообщить();
            Отказ = Истина;
            
        ИначеЕсли Выборка.ДатаНачалаДействияДоговора > ДатаПроведенияРабот Или Выборка.ДатаОкончанияДействияДоговора < ДатаПроведенияРабот Тогда
            Сообщение = Новый СообщениеПользователю();
            Сообщение.Текст = "Документ не проведен. Дата проведения работ по документу не соответствует сроку действия договора.";
            Сообщение.Сообщить();
            Отказ = Истина
        КонецЕсли;  
     Конецесли;        
КонецПроцедуры
 
 
Функция СформироватьСообщениеТелеграммБоту()
    
    ТекстСообщения = "";
    Если ЭтоНовый() Тогда
        
        ТекстСообщения = "Создана новая заявка на обслуживание клиента";
        
    Иначе
        
        СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
        "ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист");
        
        ИзмененныеРеквизиты = Новый Структура;
        ИзмененныеРеквизиты.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
        ИзмененныеРеквизиты.Вставить("ВремяНачалаРабот", ВремяНачалаРаботПлан);
        ИзмененныеРеквизиты.Вставить("ВремяОкончанияРабот", ВремяОкончанияРаботПлан);
        ИзмененныеРеквизиты.Вставить("Специалист", Специалист);
        
        Если  Не ОбщегоНазначения.ДанныеСовпадают(СтарыеРеквизиты, ИзмененныеРеквизиты) Тогда
            
            ТекстСообщения = "Произошли изменения в заявке на обслуживание клиента";
            
        КонецЕсли;
        
    КонецЕсли;
    
    
    Если ТекстСообщения <> "" Тогда
        
        ТекстСообщения = СтрШаблон("%1 №№Заявки от %2.
                        |Контрагент %3.
                        |Дата проведения работ запланирована на %4 с %5 по %6.
                        |Назначен специалист: %7.",
                        ТекстСообщения, 
                        Формат(Дата,"ДФ=dd.MM.yyyy"), Клиент, Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"),
                        Формат(ВремяНачалаРаботПлан,"ДФ=ЧЧ.мм"),Формат(ВремяОкончанияРаботПлан,"ДФ=ЧЧ.мм"), Специалист);
        
    КонецЕсли;
    
    Возврат ТекстСообщения; 
    
КонецФункции
 
#КонецОбласти
 
#КонецЕсли
